-- MaxCompute SQL 
-- ********************************************************************--
-- author:Truong, Van Thanh
-- create time:2024-09-20 11:28:43
-- ********************************************************************--
-- DROP TABLE IF EXISTS lazada_analyst_dev.loutruong_vcm_slr_list
-- ;
-- CREATE TABLE IF NOT EXISTS lazada_analyst_dev.loutruong_vcm_slr_list
-- (
--     seller_id                        BIGINT
--     ,seller_short_code               STRING
--     ,seller_name                     STRING
--     ,bu_lv1                          STRING
--     ,bu_lv2                          STRING
--     ,main_industry_name              STRING
--     ,main_cat_lv1                    STRING
--     ,segment                         STRING
--     ,pic_lead_name                   STRING
--     ,is_mp3                          BIGINT
--     ,is_sbp                          BIGINT
--     ,is_dbs                          BIGINT
--     ,is_dbs_trusted                  BIGINT
--     ,positive_seller_rating_8w       STRING
--     ,average_product_rating_8w       STRING
--     ,cancellation_percent_4w         STRING
--     ,non_fbl_fast_fulfilment_rate_4w STRING
--     ,ncp_point_90d                   STRING
--     ,is_pass                         BIGINT
--     ,asc_status                      STRING
--     ,slr_gmv_l60d                    DOUBLE
--     ,slr_ord_cnt_l60d                BIGINT
--     ,slr_gmv_l30d                    DOUBLE
--     ,slr_ord_cnt_l30d                BIGINT
--     ,plt_gmv_l60d                    DOUBLE
--     ,plt_ord_cnt_l60d                BIGINT
--     ,plt_gmv_l30d                    DOUBLE
--     ,plt_ord_cnt_l30d                BIGINT
-- )
-- PARTITIONED BY 
-- (
--     ds                               STRING
-- )
-- LIFECYCLE 367
-- ;
INSERT OVERWRITE TABLE lazada_analyst_dev.loutruong_vcm_slr_list PARTITION (ds)
SELECT t1.seller_id AS seller_id,
    t1.seller_short_code AS seller_short_code,
    t1.seller_name AS seller_name,
    t1.business_type AS bu_lv1,
    t1.business_type_level2 AS bu_lv2,
    t1.industry_name AS main_industry_name,
    t1.main_category_name AS main_cat_lv1,
    t5.new_seller_segment AS segment,
    t5.pic_lead_name AS pic_lead_name,
    COALESCE(t2.is_mp3_seller, 0) AS is_mp3,
CASE
        WHEN t1.seller_id IN (
            200162994439,
            200166690040,
            200314464336,
            200165709073,
            200164014881,
            200453040133,
            200192946361,
            1000280567,
            200169351237,
            200166003505,
            200453376777,
            1000026556,
            200163222040,
            200169390203,
            200434880956,
            200427600503,
            1000275268,
            200163738048,
            200442096610,
            200430448659,
            200162511069,
            200169006801,
            200442496035,
            200432864047,
            200162760123,
            200189016428,
            200436704572,
            200165862088,
            200166039509,
            200165895015,
            200184519343,
            1000190412,
            200428272758,
            200423824014,
            100012168,
            200162508541,
            200159406738,
            200425440799,
            200397200629,
            100017117,
            200162658649,
            200168820473,
            200402880040,
            100017862,
            200159250862,
            200413280549,
            200168592187,
            200414480324,
            1000442453,
            200182680203,
            200159124240,
            200416176014,
            200165619111,
            200159052802,
            200178519743,
            200168214469,
            200400320897,
            200386416942,
            200167701680,
            200174280099,
            200158998834,
            1000139353,
            200380352164,
            100235021,
            200174904202,
            200167932567,
            200377632002,
            200716112055,
            200158983626,
            200175870423,
            200172603107,
            200165172099,
            200618304094,
            200174346270,
            200171967204,
            200346576437,
            200167044362,
            200174370279,
            200350928035,
            200339616301,
            200167062230,
            200174391205,
            200355440969,
            200343808323,
            200605760004,
            100034668,
            1000170822,
            200337808077,
            100116912,
            200167581533,
            200342736257,
            1000378366,
            100230246,
            200167809453,
            200343328915,
            200312992087,
            200166981352,
            1000251773,
            100190764,
            200298276015,
            25390,
            200162217068,
            200167722799,
            100196091,
            1000351739,
            27928,
            200615392947,
            200164548523,
            1000173457,
            200166957208,
            1000420135,
            200233269579,
            200158980537,
            1000244414,
            200576848235,
            200328736140,
            200167827192,
            200172591087,
            200318320202,
            200234019411,
            200161524583,
            200588976561,
            200324416475,
            200231151287,
            200172291049,
            200577280632,
            200165049757,
            200673024234,
            200171877035,
            200580192076,
            200165055144,
            100003818,
            200656480764,
            200160546048,
            200560816033,
            200311920672,
            100167641,
            200659232834,
            200161161346,
            100078616,
            1000118573,
            1000094299,
            200161290307,
            200158170209,
            1000380592,
            1000334430,
            200167272155,
            200161335107,
            200166864487,
            200250300159,
            200222094629,
            200161338077,
            200166873237,
            200164737039,
            200648272337,
            200161347063,
            200521680553,
            1000118637,
            200651120395,
            200171235433,
            200166615025,
            1000119670,
            200164038516,
            200167503290,
            200160735041,
            200166708079,
            200232915812,
            200164203469,
            200170581012,
            200516592824,
            200164545191,
            200158458078,
            200509584408,
            200225580531,
            200163648227,
            200167164154,
            200170773456,
            200510608141,
            8158,
            200167191455,
            200170053299,
            200498048095,
            200164017113,
            200167170264,
            100125908,
            200502560215,
            100186118,
            200211231188,
            200590576996,
            100130902,
            200505120298,
            1000108062,
            200207562509,
            200597696820,
            100136732,
            200498624183,
            1000362684,
            28679,
            1000006784,
            200499776370,
            100126344,
            200164314880,
            100161558,
            200166624184,
            200169525299,
            100215303,
            200163579005,
            1000144709,
            1000344928,
            200163615349,
            200166762119,
            200169069732,
            200158083530,
            200212821438,
            200526944441,
            200169267625,
            200494992434,
            200213505444,
            200195160442,
            200527840954,
            200168970144,
            200166468110,
            200213616842,
            200192904654,
            200169045620,
            200491040620,
            1000059689,
            200169063256,
            200166207733,
            200209938440,
            200188722980,
            200166555315,
            100127280,
            225,
            200163027123,
            200166465066,
            200167809937,
            1000049759,
            200495440553,
            200707360233,
            100132496,
            1000333991,
            200162241006,
            200498592148,
            200707440526,
            100250345,
            200207310235,
            200183202077,
            200502544051,
            200159010931,
            200164026086,
            200687328845,
            200201985007,
            200184165593,
            100111828,
            200167575500,
            200162304020,
            1000145165,
            200167617372,
            200199630968,
            200162448187,
            1000027262,
            200629568049,
            200195409293,
            1000050244,
            200471360276,
            200619040020,
            1000264352,
            200466176058,
            1000035402,
            200166948592,
            100057054,
            1000264357,
            1000462840,
            1000036807,
            200167170070,
            1000084839,
            200456176423,
            200161854486,
            200163615186,
            200178399195,
            200457904809,
            100234885,
            200192295089,
            200162079208,
            200165808095,
            200174370271,
            100235988,
            200190726707,
            200162169146,
            200442864176,
            200174379318,
            100238630,
            200177298604,
            100208798,
            200161656949,
            200522560065,
            200162997001,
            1000258496,
            100211135,
            200158443032,
            200185836193,
            200174907196,
            1000448700,
            22437,
            200515056136,
            200185758305,
            200175906103,
            200165709351,
            25044,
            200166801086,
            100167432,
            25154,
            200434896713,
            100022269,
            200158275615,
            100025968,
            1000022223,
            200166612480,
            1000078695,
            200400032700,
            200173575354,
            200495232604,
            200162961142,
            200400064997,
            200173782101,
            200495968177,
            200177997108,
            200174070230,
            200386464150,
            200173788085,
            200497968341,
            200178579057,
            100106592,
            200173581475,
            200158242430,
            200162037101,
            200173851076,
            1000400768,
            200173590196,
            200166468104,
            200177298252,
            200173947544,
            200161305366,
            200177358123,
            1000033621,
            200165049607,
            200161362536,
            12223,
            200174439819,
            200161350557,
            200330848186,
            200173263136,
            100121297,
            200160963123,
            200331616200,
            200173278253,
            100125783,
            100000105,
            200336432532,
            200161035083,
            100045066,
            200172792116,
            1000379388,
            200172339129,
            200166978204,
            200161746391,
            200160456965,
            200298600086,
            200172795175,
            200167116195,
            200160459585,
            200246103625,
            2407,
            200567648703,
            200174211252,
            200246277179,
            100009775,
            200171277723,
            200250036573,
            200575344908,
            200171067021,
            200251728197,
            100015290,
            200576768626,
            1000047719,
            25445,
            200158521958,
            1000163666,
            1000049511,
            26248,
            100006772,
            200158698263,
            200166564524,
            200161293124,
            100136272,
            1000088844,
            200686224452,
            200172054200,
            200169954493,
            1000105945,
            200546640003,
            100154069,
            100135693,
            200164377034,
            200167608279,
            1000003553,
            200164395048,
            200167611015,
            200166456046,
            200171811112,
            200169465205,
            200228943412,
            200524032429,
            200160774161,
            1000002367,
            200229018270,
            200640960733,
            200160804171,
            200159415684,
            200229462123,
            200639456769,
            200166348830,
            200171211586,
            200169366367,
            1000334351,
            1000161875,
            200514992623,
            200169222518,
            200222481085,
            1000165359,
            100219144,
            1000181489,
            200200131911,
            1000157177,
            200159259346,
            200209395583,
            200158332404,
            200166126753,
            200168868069,
            200216559939,
            200502880090,
            200217462857,
            200166720045,
            200166129457,
            200167950402,
            200213130114,
            200166798098,
            200492784567,
            200168064141,
            200201922687,
            100202421,
            1000516802,
            200168214157,
            1000153604,
            200485472427,
            200168229023,
            200207055251,
            200166465108,
            200664144247,
            200165574103,
            200697104257,
            100168974,
            200548176361,
            200165709979,
            200668128040,
            1000069791,
            200529056021,
            200454512725,
            1000218639,
            1000075867,
            200158218281,
            200440016005,
            200160582212,
            200163645203,
            200160450909,
            1000292477,
            200516672097,
            200441440556,
            200195319850,
            200418032593,
            200195280553,
            200519472293,
            200435440332,
            200171100396,
            200512976574,
            1000008792,
            200163276190,
            200166183274,
            100007994,
            100124778,
            200192814152,
            200507264926,
            100106435,
            100248529,
            1000058426,
            200510960980,
            200392288583,
            200162742162,
            200506224061,
            200397232554,
            200169453768,
            200186946924,
            1000141978,
            1000131335,
            200169459262,
            200188119975,
            200158092545,
            1000136648,
            1000194191,
            200185947113,
            200166135701,
            200377152050,
            200169015376,
            200162487625,
            200498672165,
            200379840317,
            200168814687,
            200495856052,
            200165103009,
            100230188,
            200178132471,
            200158128839,
            200164929254,
            200167995225,
            200179290053,
            200488816993,
            200344960261,
            200168496103,
            100001361,
            200166093050,
            200349840583,
            200168058040,
            200486208586,
            200350720016,
            200168097848,
            200158068297,
            1000174967,
            1000247896,
            200166021916,
            200324608486,
            200159010838,
            1000256765,
            200471184568,
            200314576223,
            200167908108,
            200474672025,
            200317504352,
            200167851542,
            200161803256,
            200475584731,
            23481,
            200701888897,
            200165847174,
            100194141,
            200696656311,
            200174355249,
            200165886106,
            1000371499,
            200696864189,
            200174427023,
            200165889459,
            200164557340,
            200699424393,
            200174427817,
            200165859561,
            200164590475,
            200158677842,
            200174217135,
            200459376644,
            200668672602,
            200161347018,
            100165145,
            200248389023,
            508,
            200161590962,
            100182787,
            1000109455,
            100185243,
            100004246,
            200165784166,
            200245074089,
            100009848,
            200173659083,
            200443808345,
            200244246725,
            100011150,
            200173344362,
            200453968803,
            200158497871,
            100152751,
            200432816346,
            1000343687,
            200635568235,
            1000125912,
            200639392129,
            200161146326,
            1000477953,
            200225904917,
            200595408163,
            200165502445,
            200227020221,
            200620288019,
            200161194019,
            200425632994,
            200215131270,
            200613904833,
            200172015226,
            200614592462,
            200165310169,
            100219242,
            200160708049,
            200165382229,
            200217756282,
            200160816110,
            200393152294,
            5784,
            200166942087,
            200171724171,
            200389232495,
            6231,
            200166954224,
            1000223582,
            200377408136,
            100004712,
            200166957557,
            200160507577,
            200386432084,
            100005670,
            200580352015,
            100144619,
            200165040320,
            100181688,
            200564320053,
            1000016958,
            200165142024,
            200211936964,
            200169978431,
            200369024263,
            1000307278,
            200166738130,
            200170716045,
            200207823322,
            200552032058,
            1000206168,
            1000307289,
            200532144330,
            100175148,
            1000086800,
            100203796,
            100179721,
            100216770,
            200169273648,
            200336656101,
            200200914880,
            200166372759,
            1000001116,
            1000393884,
            200201034681,
            200166447726,
            1000004392,
            200164800180,
            1000280990,
            200519728369,
            200169021518,
            200192598595,
            200519968357,
            200169129156,
            200293944313,
            200516144164,
            1000088220,
            200196582072,
            200158071879,
            200168697204,
            1000095246,
            200197683568,
            200502896371,
            200251395599,
            200195433972,
            200490080142,
            200159127003,
            200164389170,
            200188185116,
            200495568824,
            200589280801,
            200232696415,
            200192583979,
            200495696283,
            200580752717,
            200233491217,
            200188200186,
            200490544506,
            100228003,
            19226,
            200190084507,
            100004774,
            200190207612,
            200166030814,
            200551584292,
            100155856,
            100004336,
            200166081253,
            200558192453,
            200483376590,
            100110175,
            200226561348,
            1000273930,
            200478160367,
            100214308,
            100156086,
            200162970414,
            200481632244,
            1000164212,
            1000299498,
            200186724373,
            200158503314,
            200163921334,
            200166042579,
            200163822294,
            200184042805,
            200165664267,
            200166609594,
            200163843380,
            200184198176,
            200166615475,
            200162184038,
            200527696121,
            200197593324,
            200162490134,
            200443920191,
            200158473026,
            100140399,
            200166582381,
            1000055793,
            200183589360,
            100188667,
            200522096058,
            1000058797,
            200176332003,
            1000445810,
            200158284953,
            200163219131,
            100159546,
            1000468586,
            200506704220,
            200163327424,
            200165610395,
            200509616548,
            200194452050,
            200174427073,
            200436304702,
            200507408466,
            200163297009,
            200174742869,
            200430720848,
            200507584162,
            200175459491,
            200411264176,
            200498368410,
            200174196370,
            200425616299,
            200503120214,
            200163060096,
            1000049605,
            200400976038,
            200158173530,
            200162610536,
            200173575492,
            1000112031,
            200158233336,
            200185980520,
            200161404024,
            200366176556,
            200166168704,
            200186982820,
            200173311152,
            200370768536,
            200485088895,
            200187087715,
            100242660,
            200377600196,
            200485936488,
            1000249555,
            1000399273,
            200472416449,
            200162232286,
            200330624005,
            200478192456,
            200162415012,
            200339728113,
            200453616932,
            200180589701,
            200161071392,
            1000097428,
            100082539,
            200161188358,
            1000102293,
            200161896236,
            200161263243,
            200321776755,
            200158131573,
            200176653370,
            200329616240,
            200165862403,
            200160849080,
            200160804148,
            200247825532,
            200439664479,
            200175894110,
            200160465601,
            200170413500,
            200270944348,
            200442400719,
            200288944031,
            200430736831,
            200160768455,
            200171169289,
            200260448615,
            200165571139,
            100025193,
            200170953027,
            19824,
            1000338429,
            200418560269,
            100137242,
            200159892875,
            100146296,
            200164335698,
            200398288367,
            1000022222,
            200170146048,
            1000219402,
            200236917910,
            200165058692,
            1000026486,
            200169459197,
            200169933998,
            200165454202,
            200161668520,
            200169957063,
            200169957468,
            200244435258,
            200372400864,
            200161551218,
            200169528279,
            200170005269,
            200378464258,
            200161572954,
            1000013860,
            200160060777,
            200164341175,
            200355520426,
            200159262865,
            200160126014,
            200235336890,
            1000102337,
            200173755117,
            200168844194,
            200169147040,
            200233281282,
            1000420142,
            1000020167,
            200169129250,
            28631,
            200165052502,
            200161290254,
            200169252540,
            200159544035,
            200230377149,
            200331136215,
            200173434147,
            200168187129,
            200168838294,
            200230443271,
            200310208457,
            200173251213,
            200168232448,
            200168292518,
            17792,
            200316752928,
            200168727186,
            100136500,
            17875,
            200287044024,
            100137989,
            29393,
            1000104103,
            200172705100,
            200168391136,
            1000318177,
            1000105081,
            100128323,
            200168085228,
            200164683028,
            100130533,
            200168214950,
            1000006850,
            200220234723,
            200263749288,
            1000220898,
            200159019471,
            200221674947,
            1000105582,
            200171811096,
            200167842186,
            200167935237,
            200244225692,
            1000015471,
            200693536124,
            200167938124,
            200214579322,
            200244456989,
            200167425041,
            200687472963,
            200214843459,
            200233482267,
            200160174420,
            200167731769,
            200167887070,
            200163840515,
            100010080,
            200160363279,
            200675872783,
            200678160818,
            200211738515,
            100166299,
            200160438457,
            200681616021,
            200166339820,
            1000088522,
            200171166267,
            200479680087,
            200213319665,
            200658384041,
            200482656553,
            200163852603,
            1000359796,
            200627840138,
            200484784343,
            200163864007,
            200224500284,
            200481184208,
            200207370025,
            200164311447,
            100235704,
            200648784181,
            200458736189,
            200207847401,
            200164341662,
            200489840016,
            200475696940,
            200205861380,
            200210676167,
            100247948,
            200474176376,
            200478064576,
            100046909,
            200215758466,
            200448848277,
            100198915,
            1000066499,
            200163879569,
            200160060420,
            200462944033,
            1000069230,
            200164035526,
            200450480549,
            1000134783,
            200199672484,
            200201907949,
            200169489032,
            100014237,
            200166063535,
            1000058151,
            200198715228,
            200442256840,
            200195379314,
            200199972344,
            1000191947,
            200218941421,
            200161587407,
            200205942817,
            200171124284,
            200352048888,
            200161035078,
            200159244054,
            100171601
        ) THEN 1
        ELSE 0
    END AS is_sbp,
    COALESCE(t3.is_delivered_by_seller, 0) AS is_dbs,
CASE
        WHEN COALESCE(t3.is_delivered_by_seller, 0) = 1
        AND t4.seller_id IS NULL THEN 1
        ELSE 0
    END AS is_dbs_trusted,
    COALESCE(t6.positive_seller_rating_8w, 'not_evaluate') AS positive_seller_rating_8w,
    COALESCE(t6.average_product_rating_8w, 'not_evaluate') AS average_product_rating_8w,
    COALESCE(t6.cancellation_percent_4w, 'not_evaluate') AS cancellation_percent_4w,
    COALESCE(
        t6.non_fbl_fast_fulfilment_rate_4w,
        'not_evaluate'
    ) AS non_fbl_fast_fulfilment_rate_4w,
    COALESCE(t6.ncp_point_90d, 'not_evaluate') AS ncp_point_90d,
CASE
        WHEN COALESCE(t3.is_delivered_by_seller, 0) = 1
        AND t4.seller_id IS NULL --<< Trusted DBS
        AND t1.industry_name NOT IN ('Digital Goods')
        AND COALESCE(t8.slr_ord_cnt_l60d, 0) > 0
        AND COALESCE(t2.is_mp3_seller, 0) = 0
        AND (
            (
                t1.business_type_level2 IN (
                    'LazMall - MP local',
                    'LazMall - MP cb',
                    'Lazada - MP'
                )
                AND (
                    t6.positive_seller_rating_8w >= 0.7
                    OR t6.positive_seller_rating_8w IS NULL
                ) --<< Tỷ lệ đánh giá tích cực trong 8 tuần >= 70% hoặc chưa đánh giá THEN VAL1
                AND (
                    t6.average_product_rating_8w >= 4.2
                    OR t6.average_product_rating_8w IS NULL
                ) --<< Điểm chất lượng sản phẩm trung bình trong vòng 8 tuần >= 4.2 hoặc chưa đánh giá
                AND (
                    t6.cancellation_percent_4w <= 0.02
                    OR t6.cancellation_percent_4w IS NULL
                ) --<< Tỷ lệ hủy đơn hàng trong vòng 4 tuần <= 2% hoặc chưa đánh giá
                AND (
                    t6.non_fbl_fast_fulfilment_rate_4w >= 0.7
                    OR t6.non_fbl_fast_fulfilment_rate_4w IS NULL
                ) --<< Tỷ lệ giao hàng nhanh non-FBL trong vòng 4 tuần >= 70% hoặc chưa đánh giá
                AND (
                    t6.ncp_point_90d < 24
                    OR t6.ncp_point_90d IS NULL
                ) --<< Điểm vi phạm trong vòng 90 ngày <24 hoặc chưa đánh giá
            )
            OR (
                t1.business_type_level2 IN ('LazGlobal - Non TBC', 'LazGlobal - TBC')
                AND (
                    t6.positive_seller_rating_8w >= 0.75
                    OR t6.positive_seller_rating_8w IS NULL
                ) --<< Tỷ lệ đánh giá tích cực trong 8 tuần >= 75% hoặc chưa đánh giá THEN VAL1
                AND (
                    t6.average_product_rating_8w >= 4.2
                    OR t6.average_product_rating_8w IS NULL
                ) --<< Điểm chất lượng sản phẩm trung bình trong vòng 8 tuần >= 4.2 hoặc chưa đánh giá
                AND (
                    t6.cancellation_percent_4w <= 0.04
                    OR t6.cancellation_percent_4w IS NULL
                ) --<< Tỷ lệ hủy đơn hàng trong vòng 4 tuần <= 4% hoặc chưa đánh giá
                AND (
                    t6.non_fbl_fast_fulfilment_rate_4w >= 0.55
                    OR t6.non_fbl_fast_fulfilment_rate_4w IS NULL
                ) --<< Tỷ lệ giao hàng nhanh non-FBL trong vòng 4 tuần >= 55% hoặc chưa đánh giá
                AND (
                    t6.ncp_point_90d < 24
                    OR t6.ncp_point_90d IS NULL
                ) --<< Điểm vi phạm trong vòng 90 ngày <24 hoặc chưa đánh giá
            )
        ) THEN 1
        WHEN COALESCE(t3.is_delivered_by_seller, 0) = 0
        AND t1.industry_name NOT IN ('Digital Goods')
        AND COALESCE(t8.slr_ord_cnt_l60d, 0) > 0
        AND COALESCE(t2.is_mp3_seller, 0) = 0
        AND (
            (
                t1.business_type_level2 IN (
                    'LazMall - MP local',
                    'LazMall - MP cb',
                    'Lazada - MP'
                )
                AND (
                    t6.positive_seller_rating_8w >= 0.7
                    OR t6.positive_seller_rating_8w IS NULL
                ) --<< Tỷ lệ đánh giá tích cực trong 8 tuần >= 70% hoặc chưa đánh giá THEN VAL1
                AND (
                    t6.average_product_rating_8w >= 4.2
                    OR t6.average_product_rating_8w IS NULL
                ) --<< Điểm chất lượng sản phẩm trung bình trong vòng 8 tuần >= 4.2 hoặc chưa đánh giá
                AND (
                    t6.cancellation_percent_4w <= 0.02
                    OR t6.cancellation_percent_4w IS NULL
                ) --<< Tỷ lệ hủy đơn hàng trong vòng 4 tuần <= 2% hoặc chưa đánh giá
                AND (
                    t6.non_fbl_fast_fulfilment_rate_4w >= 0.7
                    OR t6.non_fbl_fast_fulfilment_rate_4w IS NULL
                ) --<< Tỷ lệ giao hàng nhanh non-FBL trong vòng 4 tuần >= 70% hoặc chưa đánh giá
                AND (
                    t6.ncp_point_90d < 24
                    OR t6.ncp_point_90d IS NULL
                ) --<< Điểm vi phạm trong vòng 90 ngày <24 hoặc chưa đánh giá
            )
            OR (
                t1.business_type_level2 IN ('LazGlobal - Non TBC', 'LazGlobal - TBC')
                AND (
                    t6.positive_seller_rating_8w >= 0.75
                    OR t6.positive_seller_rating_8w IS NULL
                ) --<< Tỷ lệ đánh giá tích cực trong 8 tuần >= 75% hoặc chưa đánh giá THEN VAL1
                AND (
                    t6.average_product_rating_8w >= 4.2
                    OR t6.average_product_rating_8w IS NULL
                ) --<< Điểm chất lượng sản phẩm trung bình trong vòng 8 tuần >= 4.2 hoặc chưa đánh giá
                AND (
                    t6.cancellation_percent_4w <= 0.04
                    OR t6.cancellation_percent_4w IS NULL
                ) --<< Tỷ lệ hủy đơn hàng trong vòng 4 tuần <= 4% hoặc chưa đánh giá
                AND (
                    t6.non_fbl_fast_fulfilment_rate_4w >= 0.55
                    OR t6.non_fbl_fast_fulfilment_rate_4w IS NULL
                ) --<< Tỷ lệ giao hàng nhanh non-FBL trong vòng 4 tuần >= 55% hoặc chưa đánh giá
                AND (
                    t6.ncp_point_90d < 24
                    OR t6.ncp_point_90d IS NULL
                ) --<< Điểm vi phạm trong vòng 90 ngày <24 hoặc chưa đánh giá
            )
        ) THEN 1
        ELSE 0
    END AS is_pass,
CASE
        WHEN t7.seller_id IS NULL THEN 'Not invite'
        ELSE 'Invited'
    END AS vcm_status,
    COALESCE(t8.slr_gmv_l60d, 0) AS slr_gmv_l60d,
    COALESCE(t8.slr_ord_cnt_l60d, 0) AS slr_ord_cnt_l60d,
    COALESCE(t8.slr_gmv_l30d, 0) AS slr_gmv_l30d,
    COALESCE(t8.slr_ord_cnt_l30d, 0) AS slr_ord_cnt_l30d,
    COALESCE(t9.plt_gmv_l60d, 0) AS plt_gmv_l60d,
    COALESCE(t9.plt_ord_cnt_l60d, 0) AS plt_ord_cnt_l60d,
    COALESCE(t9.plt_gmv_l30d, 0) AS plt_gmv_l30d,
    COALESCE(t9.plt_ord_cnt_l30d, 0) AS plt_ord_cnt_l30d,
    TO_CHAR(DATEADD(GETDATE(), -1, 'dd'), 'yyyymmdd') AS ds
FROM (
        SELECT seller_id,
            seller_short_code,
            seller_name,
            business_type,
            business_type_level2,
            industry_name,
            main_category_name,
            1 AS map_key
        FROM lazada_cdm.dim_lzd_slr_seller_extra_vn
        WHERE 1 = 1
            AND ds = MAX_PT('lazada_cdm.dim_lzd_slr_seller_extra')
            AND venture = 'VN'
    ) AS t1
    LEFT JOIN (
        SELECT seller_id,
            is_mp3_seller
        FROM lazada_cdm.dim_lzd_slr_seller_vn
        WHERE 1 = 1
            AND ds = MAX_PT('lazada_cdm.dim_lzd_slr_seller')
            AND venture = 'VN'
    ) AS t2 ON t1.seller_id = t2.seller_id
    LEFT JOIN (
        SELECT seller_id,
            MAX(is_delivered_by_seller) AS is_delivered_by_seller
        FROM lazada_cdm.dim_lzd_prd_product
        WHERE 1 = 1
            AND ds = MAX_PT('lazada_cdm.dim_lzd_prd_product') --<< Take the lastest snapshot
            AND venture = 'VN'
        GROUP BY seller_id
    ) AS t3 ON t1.seller_id = t3.seller_id
    LEFT JOIN (
        SELECT *
        FROM lazada_analyst_dev.loutruong_slr_non_trusted_dbs
    ) AS t4 ON t1.seller_id = t4.seller_id
    LEFT JOIN (
        SELECT ext_num_id AS seller_id,
            new_seller_segment,
            commercial_team,
            pic_lead_name
        FROM lazada_analyst_dev.vn_map_memid_slrid
        WHERE 1 = 1
            AND date_ = MAX_PT('lazada_analyst_dev.vn_map_memid_slrid')
    ) AS t5 ON t1.seller_id = t5.seller_id
    LEFT JOIN (
        SELECT seller_id,
            slr_rvw_pos_rate_8w AS positive_seller_rating_8w,
            prd_rvw_avg_prd_quality_rating_8w AS average_product_rating_8w,
            cancellation_rate AS cancellation_percent_4w,
            fast_fulfilment_rate_ds AS non_fbl_fast_fulfilment_rate_4w,
            ncp_point AS ncp_point_90d
        FROM lazada_cdm.dws_lzd_slr_health_nd
        WHERE 1 = 1
            AND ds = MAX_PT('lazada_cdm.dws_lzd_slr_health_nd')
            AND venture = 'VN'
    ) AS t6 ON t1.seller_id = t6.seller_id
    LEFT JOIN (
        SELECT DISTINCT seller_id
        FROM lazada_ds.ds_lzd_program_seller
        WHERE 1 = 1
            AND ds = MAX_PT("lazada_ds.ds_lzd_program_seller")
            AND venture = 'VN'
            AND program_id IN (
                SELECT id
                FROM lazada_ds.ds_lzd_program
                WHERE 1 = 1
                    AND ds = MAX_PT('lazada_ds.ds_lzd_program')
                    AND venture = 'VN'
                    AND program_type = 24
                    AND is_test = 0
                    AND status = 1
                    AND REGEXP_INSTR(name, '^.*(TEST|Test|test)+.*') = 0
            )
    ) AS t7 ON t1.seller_id = t7.seller_id
    LEFT JOIN (
        SELECT seller_id,
            SUM(actual_gmv * exchange_rate) AS slr_gmv_l60d,
            COUNT(DISTINCT order_id) AS slr_ord_cnt_l60d,
            SUM(
                CASE
                    WHEN ds >= TO_CHAR(DATEADD(GETDATE(), -31, 'dd'), 'yyyymmdd') THEN actual_gmv * exchange_rate
                    ELSE 0
                END
            ) AS slr_gmv_l30d,
            COUNT(
                DISTINCT CASE
                    WHEN ds >= TO_CHAR(DATEADD(GETDATE(), -31, 'dd'), 'yyyymmdd') THEN order_id
                    ELSE NULL
                END
            ) AS slr_ord_cnt_l30d
        FROM lazada_cdm.dwd_lzd_trd_core_fulfill_di
        WHERE 1 = 1
            AND ds >= TO_CHAR(DATEADD(GETDATE(), -61, 'dd'), 'yyyymmdd')
            AND venture = 'VN'
            AND is_revenue = 1
            AND COALESCE(business_application, 'LZD') IN ('LZD,ZAL', 'LZD')
        GROUP BY seller_id
    ) AS t8 ON t1.seller_id = t8.seller_id
    LEFT JOIN (
        SELECT SUM(actual_gmv * exchange_rate) AS plt_gmv_l60d,
            COUNT(DISTINCT order_id) AS plt_ord_cnt_l60d,
            SUM(
                CASE
                    WHEN ds >= TO_CHAR(DATEADD(GETDATE(), -31, 'dd'), 'yyyymmdd') THEN actual_gmv * exchange_rate
                    ELSE 0
                END
            ) AS plt_gmv_l30d,
            COUNT(
                DISTINCT CASE
                    WHEN ds >= TO_CHAR(DATEADD(GETDATE(), -31, 'dd'), 'yyyymmdd') THEN order_id
                    ELSE NULL
                END
            ) AS plt_ord_cnt_l30d,
            1 AS map_key
        FROM lazada_cdm.dwd_lzd_trd_core_fulfill_di
        WHERE 1 = 1
            AND ds >= TO_CHAR(DATEADD(GETDATE(), -61, 'dd'), 'yyyymmdd')
            AND venture = 'VN'
            AND is_revenue = 1
            AND COALESCE(business_application, 'LZD') IN ('LZD,ZAL', 'LZD')
    ) AS t9 ON t1.map_key = t9.map_key;
-- SELECT  *
-- FROM    lazada_analyst_dev.loutruong_vcm_slr_list
-- WHERE   1 = 1
-- AND     ds >= TO_CHAR(DATEADD(GETDATE(),-8,'dd'),'yyyymmdd')
-- ;